Ran Plan for 4 projects:

1. project: `frontend_amer_nodes` dir: `frontend/gcp_nodes` workspace: `amer`
1. project: `frontend_euro_nodes` dir: `frontend/gcp_nodes` workspace: `euro`
1. project: `frontend_asia_nodes` dir: `frontend/gcp_nodes` workspace: `asia`
1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`

### 1. project: `frontend_amer_nodes` dir: `frontend/gcp_nodes` workspace: `amer`
<details><summary>Show Output</summary>

```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 19, in resource "google_compute_address" "static":
  19:   count = "${var.nodes[terraform.workspace]}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_nodes%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_nodes`
</details>

---
### 2. project: `frontend_euro_nodes` dir: `frontend/gcp_nodes` workspace: `euro`
<details><summary>Show Output</summary>

```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 19, in resource "google_compute_address" "static":
  19:   count = "${var.nodes[terraform.workspace]}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_nodes%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_nodes`
</details>

---
### 3. project: `frontend_asia_nodes` dir: `frontend/gcp_nodes` workspace: `asia`
<details><summary>Show Output</summary>

```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 19, in resource "google_compute_address" "static":
  19:   count = "${var.nodes[terraform.workspace]}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_nodes%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_nodes`
</details>

---
### 4. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-amer-us-central1-c"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = "projects/2036174436/zones/us-central1-c/instanceGroupManagers/asg-group-manager-amer-us-central1-c"
      + zone               = "var.zones[terraform.workspace][count.index]"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 1
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
